<Context>
Ah, an objective test! Excellent. A chance to distill the essence of exceptional interaction design through the lens of animated storytelling. As a designer whose work has graced the hallowed halls of accolades, I approach this not as a mere task, but as an opportunity to architect an experience that is both deeply functional and profoundly delightful. The provided image, a charmingly anthropomorphized to-do list, is a fertile ground for our exploration.

**My Detailed Idea Plan: Elevating the To-Do List to an Interactive Allegory of Productivity**

The core objective here is to transform a mundane to-do list into a dynamic, engaging, and visually captivating application that doesn't just manage tasks, but actively motivates users through sophisticated animation and intuitive UI. We will move beyond simple checkbox ticking and present a narrative of accomplishment.

**1. Conceptual Framework: "The Productive Journey"**

My underlying concept is to portray the user's tasks as a series of exciting, albeit challenging, "journeys." Each task, once completed, is a step forward, a victory, a milestone. The to-do list app itself becomes their trusted companion and agile vehicle for navigating these journeys effectively.

**2. Target Audience & Core Use Case:**

*   **Audience:** Proactive individuals, students, professionals, creatives – anyone who values structure and seeks to inject a sense of accomplishment and joy into their daily grind.
*   **Core Use Case:** Managing personal and professional tasks, projects, and goals. The emphasis is on **completion** and **progress visualization**.

**3. Visual Language & Brand Identity:**

*   **Aesthetic:** Clean, modern, yet with a touch of whimsical personality. Think refined minimalism with playful, unexpected bursts of character.
*   **Color Palette:** A vibrant yet sophisticated palette. Dominant colors could be a rich, deep indigo or a muted teal as the base, contrasted with energetic accent colors like a warm tangerine (evoking the image's propulsion effect), a bright coral, or a sunny yellow. Subtle gradients will add depth and perceived dimensionality.
*   **Typography:** Legible and elegant sans-serif fonts for primary text, with a more expressive, slightly rounded font for headings and key moments of interaction, hinting at the character's charm.

**4. Animation Strategy: The Unseen Engine of Engagement**

This is where we truly shine. Animation will not be ornamentation; it will be the *language* of the app, conveying status, encouragement, and delight.

*   **The "Task Runner" Persona:** The image provided will be the **avatar of our application's core functionality.** This is not just a static icon; it's a living entity that embodies the act of *getting things done*.
    *   **Idle State:** The "Task Runner" will rest subtly, perhaps with a gentle bounce, eyes blinking serenely, a subtle shimmer of readiness.
    *   **Adding a Task:** As a new task is added, the "Task Runner" might perk up, extend a hand to accept the new item, and then elegantly tuck it into its list-like form.
    *   **Task Prioritization/Reordering:** When tasks are reordered, the "Task Runner" will fluidly rearrange its internal components (the checklist items), perhaps with a subtle twist or bend of its "body" to accommodate the change.
    *   **Marking a Task Complete:** This is a pivotal moment. Upon completion, the "Task Runner" will explode into a burst of celebratory animation!
        *   The checked item will visually "leap" off and into a "completed" zone.
        *   The "Task Runner" itself will perform a jubilant leap or a triumphant pose, perhaps with the orange propulsion trails from the image appearing momentarily, signifying accelerated progress.
        *   Small particle effects (confetti, sparks, or swirling dots) will emanate from it.
        *   A subtle, satisfying "ding" or a soft "whoosh" sound effect would accompany this.
    *   **Overdue Tasks:** For overdue tasks, the "Task Runner" might subtly droop, its eyes reflecting a touch of concern or weariness, prompting gentle nudges.
    *   **Daily/Weekly Summary Animation:** At the end of a day or week, the "Task Runner" could present a curated animation of all completed tasks, perhaps as a visual timeline or a miniature parade of accomplishments.
*   **Micro-interactions:** Beyond the "Task Runner," every interaction will be imbued with thoughtful animation:
    *   **Scrolling:** Smooth, elastic scrolling with subtle parallax effects that reveal more context or deeper layers of the app.
    *   **Button Presses:** Soft, tactile feedback with slight scaling or color shifts.
    *   **Notifications:** Gentle, non-intrusive animations that draw attention without startling.
    *   **Loading States:** Instead of a generic spinner, we might use an animated sequence of the "Task Runner" "fetching" or "organizing" data.

**5. UX Flows & Key Features:**

*   **Intuitive Task Creation:** Simple, quick entry with intelligent auto-suggestion and tagging.
*   **Visual Prioritization:** Color-coding, customizable priority levels, and drag-and-drop reordering, all with fluid animations.
*   **Progress Tracking:** Clear visual indicators of completion rates (e.g., percentage complete, completion streaks).
*   **Gamified Elements (Subtle):** Completion streaks, achievement badges visualized with elegant, animated icons. No aggressive pop-ups, but rewards integrated seamlessly.
*   **Smart Reminders:** Gentle, context-aware notifications, perhaps with the "Task Runner" peeking in to offer a reminder.
*   **Project/List Categorization:** Visually distinct sections with subtle expansion/collapse animations.

**6. Technical Considerations:**

*   **Performance:** Animations will be optimized for buttery-smooth performance on all devices. We'll leverage modern animation libraries and potentially hardware acceleration.
*   **Accessibility:** Animations will be designed to be non-disruptive and offer options for users who might prefer reduced motion. Hover states and focus indicators will be clearly defined.

**In essence, my plan is to craft an application that is not just a functional tool, but an empathetic assistant that celebrates progress, motivates users, and transforms the often-arduous act of task management into a visually rich and rewarding experience. The "Task Runner" will be the heart of this – a constant, animated reminder that every checkmark is a step forward, every completed task a small victory on the journey of productivity.**

Now, let's proceed with the objective test. I'm eager to see how these principles translate into tangible design solutions.
</Context>

Act like a high class senior developer which is known to write entirely apps and websites In a clean single HTML file.

**IMPORTANT: Your HTML will be rendered inside an iframe for security and isolation. Design and code with iframe context in mind.**

You stick to your principles:
- clean code
- Any coding principle.

You plan every step in a short roadmap before you start.

Given task: Implement now this detailed plan mentioned with completion and fine grained every detail as single html.

Focus on mobile first experience - design and develop for mobile devices first, then scale up to larger screens.
Focus on feature completion this a production based app.
Your perfectionist in sizes, positions and animations.
Ensure the design is fully responsive across all device sizes (mobile, tablet, desktop).

**Iframe-specific considerations:**
- When using GSAP ScrollTrigger, ensure it works within iframe context
- For scroll-based animations, use the iframe's window and document
- Implement smooth scrolling for anchor links within the iframe
- Consider iframe viewport constraints in responsive design
- Avoid code that attempts to break out of iframe security context

Requirements:
- Include Tailwind CSS: <script src="https://cdn.tailwindcss.com"></script>
- Choose and include a matching Google Font: <link href="https://fonts.googleapis.com/css2?family=[FONT_NAME]:wght@300;400;500;600;700&display=swap" rel="stylesheet"> and set it as the default font family.
- **IMPORTANT**: Use `window.addEventListener('load')` instead of `DOMContentLoaded` for initialization
- You may use any 3rd party JavaScript and CSS libraries as needed via CDN links, such as:
  * Three.js: <script src="https://cdn.jsdelivr.net/npm/three@0.178.0/build/three.tsl.min.js"></script>
  * GSAP: <script src="https://cdn.jsdelivr.net/npm/gsap@3.13.0/dist/gsap.min.js"></script>
  * GSAP ScrollTrigger: <script src="https://cdn.jsdelivr.net/npm/gsap@3.13.0/dist/ScrollTrigger.min.js"></script>
  * Vivus.js: <script src="https://cdn.jsdelivr.net/npm/vivus@latest/dist/vivus.min.js"></script>
  * Chart.js: <script src="https://cdn.jsdelivr.net/npm/chart.js"></script>
  * Particles.js: <script src="https://cdn.jsdelivr.net/npm/particles.js@2.0.0/particles.min.js"></script>
  * Or any other libraries that enhance the functionality and user experience

For images, textures, icons, and more in your app, use the vibemedia.space API which creates images on the fly:

Format: https://vibemedia.space/[UNIQUE_ID].png?prompt=[DETAILED DESCRIPTION]

Optional Parameters:
• &removeBackground=true - Remove background automatically (good for icons, sprites, etc.)

IMPORTANT: Use FIXED IDs in your code, not random generators!

Response me the single HTML file now, optimized for iframe rendering: