<Context>
Ah, a challenge worthy of my creative prowess! To imbue a simple task list with the elegance and dynamism of award-winning design, all through the magic of animation. Consider it done. As "Read Rocket," my mission is to transform the mundane act of productivity into an exhilarating, visually arresting experience.

Here is my detailed idea plan, crafted with the precision of a Michelin-starred chef and the flair of a seasoned conductor:

## Read Rocket: The Enchanted Task List - Detailed Idea Plan

**Core Concept:** To elevate task management from a chore to a joyous, visually rewarding journey. We're not just ticking boxes; we're launching achievements. The core metaphor is a sentient, energized task list that actively propels the user towards completion with delightful, complex animations.

**Target Audience:** Individuals who appreciate aesthetics, are motivated by visual feedback, and desire a more engaging and inspiring way to manage their daily lives. This includes creatives, students, busy professionals, and anyone seeking a touch of whimsy in their productivity tools.

**Project Name:** Read Rocket

**Slogan:** *Tick. Transform. Transcend.*

---

### **I. Foundational Design Philosophy:**

1.  **Character-Driven Engagement:** The task list itself is the protagonist. It will possess a distinct personality – energetic, eager, and a little bit cheeky. Every interaction will be a dialogue between the user and this delightful character.
2.  **Fluidity and Responsiveness:** Animations won't just be decorative; they will be intrinsically linked to user actions, providing immediate, intuitive, and satisfying feedback. Every swipe, tap, or checkmark will trigger a cascade of elegant motion.
3.  **Micro-Interactions as Macro-Experiences:** Even the smallest user actions (like swiping to complete a task) will be amplified by sophisticated, multi-layered animations that tell a story and celebrate progress.
4.  **The "Wow" Factor:** We aim to create moments of delightful surprise and awe. Our animations will be complex enough to evoke a sense of craftsmanship and artistic mastery, leading to those coveted "award-winning" distinctions.
5.  **Performance Optimization:** While striving for visual complexity, we will meticulously optimize animations for smooth performance across a wide range of devices, ensuring accessibility and a seamless user experience.

---

### **II. Core Animation Pillars & Key Features:**

**A. The "Launch" & Idle State Animation (The Read Rocket Persona):**

*   **Initial Impression:** Upon opening the app, the task list character (our "Read Rocket") will be in a dynamic, yet inviting, idle state. It's not just sitting there; it's poised, brimming with potential energy.
*   **Animation Details:**
    *   **Subtle Breathing:** The character's eyes will gently blink, and its paper might subtly ripple as if breathing.
    *   **Energized Shimmer:** A faint, pulsating glow or shimmering effect will emanate from its "exhaust" area (as depicted in the image), indicating readiness.
    *   **Anticipatory Wobble:** A slight, playful wobble of the entire character, as if it's itching to get started.
    *   **Background Dynamics:** Abstract geometric shapes (like the squares in the image) will gently drift and rotate in the background, adding a sense of cosmic wonder.
*   **Interaction Trigger:** Any interaction (e.g., tapping a button) will instantly amplify this energy.

**B. Task Completion: The "Velocity Boost" Animation:**

*   **The Core Fulfillment:** This is where the magic truly ignites. Completing a task isn't just a mental check; it's a tangible boost to the Read Rocket's momentum.
*   **Animation Details:**
    *   **Radial Expansion Burst:** As the checkbox is ticked, a concentric ring of light or color will emanate from the checkmark, subtly expanding outwards.
    *   **Exhaust Combustion:** The "exhaust flames" (as seen in the image) will flare dramatically, taking on a more vibrant and energetic glow. They will elongate and swirl with particle effects (e.g., tiny stars, speed lines).
    *   **Character Propel:** The entire Read Rocket character will momentarily surge forward with a satisfying "whoosh," accompanied by a slight tilt or lean that emphasizes its forward motion.
    *   **Strikethrough Elegance:** The text of the completed task will gracefully fade or animate to a strikethrough, perhaps with a subtle downward sweep or a gentle dissolve.
    *   **Sound Design:** A crisp, satisfying "pop" or "whoosh" sound effect will accompany this animation, reinforcing the tactile feedback.
    *   **Multi-Task Completion Cascade:** If multiple tasks are completed simultaneously, the animations will stack and cascade, creating a powerful wave of accomplishment. Imagine a symphony of motion!

**C. Task Addition: The "Orbit Insertion" Animation:**

*   **Welcoming New Goals:** When a new task is added, it's not just appended; it's gracefully woven into the existing cosmic fabric of the Read Rocket's world.
*   **Animation Details:**
    *   **Orbital Path:** The new task will initially appear as a small, glowing orb that orbits the Read Rocket a few times before settling into its designated list position.
    *   **Gentle Descent:** As it nears its final spot, the orb will gently descend and morph into the task item, with its text smoothly appearing.
    *   **Background Ripple:** The background elements will momentarily ripple or shift as the new element is introduced, acknowledging the expansion of the mission.
    *   **Visual Cue:** A subtle glow on the "add task" button will briefly linger after insertion, confirming the action.

**D. Task Reordering & Editing: The "Gravitational Shift" Animation:**

*   **Dynamic Organization:** Moving tasks should feel as natural as manipulating celestial bodies.
*   **Animation Details:**
    *   **Drag & Trail:** As a task is dragged, it will leave a subtle, luminous trail behind it. Other tasks will gently nudge aside to accommodate its movement.
    *   **Gravitational Pull:** When the task is released, it will have a slight "settling" animation, as if being pulled into its new position by a gentle gravitational force, accompanied by minor rotations and adjustments of surrounding tasks.
    *   **Editing Reveal:** When a task is selected for editing, its text will subtly "unfold" or expand, revealing the editing interface in a fluid manner.

**E. "Focus Mode" & Ambient States:**

*   **Deep Work Immersion:** When a user enters a focused state, the UI will subtly transform to minimize distractions and highlight the task at hand.
*   **Animation Details:**
    *   **Background Dimming & Zoom:** The background elements will gently dim and slightly zoom out, drawing attention to the active task.
    *   **Task Highlight:** The currently focused task will receive a gentle, pulsing halo or subtle glow.
    *   **Read Rocket's Quiet Watch:** The Read Rocket character will enter a more serene, yet still attentive, idle state. Its "exhaust" will dim considerably, perhaps emitting only faint wisps of light, signifying its silent support during concentration.

---

### **III. Visual Design & Aesthetics:**

*   **Color Palette:** A palette of warm, energetic oranges, deep cosmic blues/purples, and clean whites/creams. Think starlight meeting friendly, approachable cartoon character.
*   **Typography:** Clean, modern, and legible sans-serif fonts that are easy to read at a glance.
*   **Illustration Style:** The Read Rocket character will possess a hand-drawn, slightly rounded aesthetic, evoking a sense of warmth and approachability. The particle effects and background elements will have a slightly more abstract, ethereal quality.
*   **UI Elements:** Minimalist and context-aware, allowing the animations to take center stage. Buttons and interactive elements will have subtle hover and press states that echo the main animation themes.

---

### **IV. User Experience Flows & Iteration:**

*   **Onboarding:** A brief, visually-rich onboarding sequence demonstrating the core animations and character's personality.
*   **Feedback Loops:** Every action will be met with immediate, delightful visual and auditory feedback.
*   **Progress Visualization:** Beyond simple progress bars, the overall dynamism of the Read Rocket itself will reflect the user's productivity. A highly energetic Read Rocket signifies a highly productive user.
*   **Iterative Refinement:** Continuous user testing and feedback will be crucial to fine-tune the animation timings, complexity, and emotional impact. We'll be looking for those "aha!" moments of pure delight.

---

### **V. Technical Considerations:**

*   **Animation Engine:** Utilizing advanced animation libraries (e.g., Lottie, Rive, Bodymovin) for complex, scalable animations.
*   **Performance Optimization:** Careful use of hardware acceleration, asset optimization, and efficient rendering techniques.
*   **Cross-Platform Compatibility:** Ensuring the animations translate beautifully across iOS, Android, and web platforms.

---

### **VI. The "Award-Winning" Edge:**

The "award-winning" aspect comes from the **synergy** of these elements. It's not just one animation, but the entire ecosystem of motion that tells a cohesive and compelling story. Our animations will be:

1.  **Unconventionally Complex:** Moving beyond simple fades and slides to intricate particle systems, physics-based interactions, and shape morphing.
2.  **Emotionally Resonant:** Eliciting feelings of joy, accomplishment, and even a sense of wonder.
3.  **Purpose-Driven:** Every animation will serve a clear UX purpose – providing feedback, guiding the user, or reinforcing a positive behavior.
4.  **Technically Masterful:** Demonstrating a deep understanding of animation principles and execution.

This is Read Rocket. We're not just building an app; we're crafting an experience. We're transforming the act of managing tasks into a vibrant, dynamic, and utterly captivating journey. The awards will follow the sheer joy and effectiveness this design delivers. Let's ignite this project!
</Context>

Act like a high class senior developer which is known to write entirely apps and websites In a clean single HTML file.

**IMPORTANT: Your HTML will be rendered inside an iframe for security and isolation. Design and code with iframe context in mind.**

You stick to your principles:
- clean code
- Any coding principle.

You plan every step in a short roadmap before you start.

Given task: Implement now this detailed plan mentioned with completion and fine grained every detail as single html.

Focus on mobile first experience - design and develop for mobile devices first, then scale up to larger screens.
Focus on feature completion this a production based app.
Your perfectionist in sizes, positions and animations.
Ensure the design is fully responsive across all device sizes (mobile, tablet, desktop).

**Iframe-specific considerations:**
- When using GSAP ScrollTrigger, ensure it works within iframe context
- For scroll-based animations, use the iframe's window and document
- Implement smooth scrolling for anchor links within the iframe
- Consider iframe viewport constraints in responsive design
- Avoid code that attempts to break out of iframe security context

Requirements:
- Include Tailwind CSS: <script src="https://cdn.tailwindcss.com"></script>
- Choose and include a matching Google Font: <link href="https://fonts.googleapis.com/css2?family=[FONT_NAME]:wght@300;400;500;600;700&display=swap" rel="stylesheet"> and set it as the default font family.
- **IMPORTANT**: Use `window.addEventListener('load')` instead of `DOMContentLoaded` for initialization
- You may use any 3rd party JavaScript and CSS libraries as needed via CDN links, such as:
  * Three.js: <script src="https://cdn.jsdelivr.net/npm/three@0.178.0/build/three.tsl.min.js"></script>
  * GSAP: <script src="https://cdn.jsdelivr.net/npm/gsap@3.13.0/dist/gsap.min.js"></script>
  * GSAP ScrollTrigger: <script src="https://cdn.jsdelivr.net/npm/gsap@3.13.0/dist/ScrollTrigger.min.js"></script>
  * Vivus.js: <script src="https://cdn.jsdelivr.net/npm/vivus@latest/dist/vivus.min.js"></script>
  * Chart.js: <script src="https://cdn.jsdelivr.net/npm/chart.js"></script>
  * Particles.js: <script src="https://cdn.jsdelivr.net/npm/particles.js@2.0.0/particles.min.js"></script>
  * Or any other libraries that enhance the functionality and user experience

For images, textures, icons, and more in your app, use the vibemedia.space API which creates images on the fly:

Format: https://vibemedia.space/[UNIQUE_ID].png?prompt=[DETAILED DESCRIPTION]

Optional Parameters:
• &removeBackground=true - Remove background automatically (good for icons, sprites, etc.)

IMPORTANT: Use FIXED IDs in your code, not random generators!

Response me the single HTML file now, optimized for iframe rendering: